export const questions = [
    {
        question: "ما هي لغة PHP؟",
        answer: "لغة PHP هي لغة برمجة مفتوحة المصدر تُستخدم بشكل رئيسي في تطوير تطبيقات الويب. تم تصميمها في الأصل لتطوير صفحات ويب ديناميكية، وتعتبر واحدة من أكثر اللغات شيوعًا في هذا المجال. اسم PHP هو اختصار لـ 'PHP: Hypertext Preprocessor'، وهي لغة برمجية تُدمج مع HTML لتسهيل إنشاء مواقع تفاعلية."
    },
    {
        question: "مميزات لغة PHP",
        answer:"سهلة التعلم حيث يمكن للمبتدئ في البرمجة تعلمها بسهولة بسبب بساطة الأكواد. تدخل في بناء المواقع والمتاجر وبرامج الكومبيوتر. تساعد في تحسين محركات البحث، حيث تتميّز بسرعة كبيرة تفوق ثلاثة أضعاف سرعة لغة البايثون. مجانية ومفتوحة المصدر."
    },

    {
        question: "دوال لغة PHP",
        answer:"قوة PHP تأتي من الدوال Functions التي توفرها والتي تسهل عملك مع اي نوع من انواع البيانات حيث انها توفر أكثر من ١٠٠٠ دالة "
    },
    {
        question: "الجمل الشرطية",
        answer:" الجمل الشرطية (التي هي عبارات if-else، وعبارة switch). حيث تُستعمَل هذه العبارات لاتخاذ القرارات وتنفيذ إجراءات اعتمادًا على تحقيق شرطٍ معيّن وهي من أهم التعابير البرمجية التي علينا تعلمها؛ لننظر إلى مثالٍ أولًا."
    },
    {
        question: "التكرار في لغة  php ",
        answer:"يتم استخدام الحلقات لتنفيذ نفس كتلة الكود مرارًا وتكرارًا ، حتى يتم استيفاء شرط معين        الفكرة الأساسية وراء حلقة التكرار هي أتمتة المهام المتكررة داخل برنامج لحفظ الوقت والجهد  تدعم PHP أربعة أنواع مختلفة من الحلقات"
    },
    {
        question: "عمل صفحة رئيسية",
        answer:"يتم استخدام الحلقات لتنفيذ نفس كتلة الكود مرارًا وتكرارًا ، حتى يتم استيفاء شرط معين        الفكرة الأساسية وراء حلقة التكرار هي أتمتة المهام المتكررة داخل برنامج لحفظ الوقت والجهد  تدعم PHP أربعة أنواع مختلفة من الحلقات"
    },
    {
        question: "ربط الفحات",
        answer:"يتم استخدام الحلقات لتنفيذ نفس كتلة الكود مرارًا وتكرارًا ، حتى يتم استيفاء شرط معين        الفكرة الأساسية وراء حلقة التكرار هي أتمتة المهام المتكررة داخل برنامج لحفظ الوقت والجهد  تدعم PHP أربعة أنواع مختلفة من الحلقات"
    },
]